app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (confirmed_at IS NOT NULL)
---
  def index
    @users = User.all.confirmed